LPNBCTestCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs                ("liblumpedParameterNetworkBC.so");

application         solids4Foam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             8;

deltaT              0.001;

writeControl        timeStep;

writeInterval       50;

purgeWrite          0;

writeFormat         ascii;

writePrecision      9;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

adjustTimeStep      no;

maxCo               0.5;


functions
(

    flowRateInlet
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;
        log             true;
        valueOutput     true;
        source          patch;
        sourceName      inlet;
        operation       sum;
	    surfaceFormat   off;

        fields
        (
            phi
        );
    }
    
    flowRateOutlet
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;
        log             true;
        valueOutput     true;
        source          patch;
        sourceName      outlet;
        operation       sum;
	    surfaceFormat   off;

        fields
        (
            phi
        );
    }

    pAverageInlet
	  {
         type            faceSource;
         functionObjectLibs ("libfieldFunctionObjects.so");
         enabled         true;
         outputControl   timeStep;
         log             true;
         valueOutput     true;
         source          patch;
         sourceName      inlet;
         operation      areaAverage;
      	surfaceFormat   off;
        fields
        (
            p
        );
	  }

    pAverageOutlet
	  {
         type            faceSource;
         functionObjectLibs ("libfieldFunctionObjects.so");
         enabled         true;
         outputControl   timeStep;
         log             true;
         valueOutput     true;
         source          patch;
         sourceName      outlet;
         operation       areaAverage;
      	surfaceFormat   off;
        fields
        (
            p
        );
	  }

);




// ************************************************************************* //
