LPNBCTestCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         leastSquares;
}

divSchemes
{
    default                         none;
    div(phi,U)                      Gauss linearUpwind cellLimited leastSquares 1;
    div((nuEff*dev(grad(U).T())))   Gauss linear;
    div((nuEff*dev(T(grad(U)))))    Gauss linear;

    div(phi,epsilon)                Gauss linear;
    div(phi,k)                      Gauss linear;
}

laplacianSchemes
{
    default                         none;
    laplacian(nu,U)                 Gauss linear corrected;
    laplacian(nuEff,U)              Gauss linear corrected;
    
    laplacian(rAU,p)                Gauss linear corrected;

    laplacian((1|A(U)),p)           Gauss linear skewCorrected 0.5;

    laplacian(DepsilonEff,epsilon)  Gauss linear corrected;
    laplacian(DkEff,k)              Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(U)  linear;
}

snGradSchemes
{
    default         skewCorrected 0.5;
}

// ************************************************************************* //
