LPNBCTestCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p|pFinal"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }

    "U|UFinal|k|epsilon"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }
}

PISO
{
    nCorrectors                 3;
    nNonOrthogonalCorrectors    1;
}

PIMPLE 
{
    nOuterCorrectors            1; // Iterative PISO
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;
    
    residualControl
    {
        U
        {
            relTol      0;
            tolerance   1e-7;
        }
        p
        {
            relTol      0;
            tolerance   1e-7;
        }
    }
    
}

/*
relaxationFactors
{
    equations
    {
        U    0.7;
        UFinal 0.7;
    }
    fields
    {
        p    0.3;
        pFinal    0.3;
    }
}
*/

// ************************************************************************* //
